- Filling-In Missing Values

Sometimes we have to fill in data because we don't want to drop the entire row because just few values are missing. so We can use fillna method to fill in data

In [2]:
# Here is how to import pandas in your project
import pandas as pd;

1. To replace all missing values with a given value

In [3]:
userDataFrame11 = pd.DataFrame({'name': ['Alice', 'Janvier', 'Naomie', 'Kate', 'Bob', 'Jeff', 'Jack'], 'age': [25, 30, 11, 25, 40, 25, None], 'city': ['Rockville', 'Germantown', 'Denver', 'Rome', None, 'Harrisonburg', None]})
userDataFrame11.fillna(0) # Every missing value will be replaced with 0

      name   age          city
0    Alice  25.0     Rockville
1  Janvier  30.0    Germantown
2   Naomie  11.0        Denver
3     Kate  25.0          Rome
4      Bob  40.0             0
5     Jeff  25.0  Harrisonburg
6     Jack   0.0             0

2. To replace all the missing column values with a given value calculated using math function like min,

In [4]:
userDataFrame12 = pd.DataFrame({'name': ['Alice', 'Janvier', 'Naomie', 'Kate', 'Bob', 'Jeff', 'Jack'], 'age': [25, 30, 11, 25, None, 25, None], 'city': ['Rockville', 'Germantown', 'Denver', 'Rome', None, 'Harrisonburg', None]})
meanAge = userDataFrame12['age'].mean() # mean of all age values
userDataFrame12['age'].fillna(meanAge, inplace=True) # Replace all missing values on age column with this meanAge
userDataFrame12

      name   age          city
0    Alice  25.0     Rockville
1  Janvier  30.0    Germantown
2   Naomie  11.0        Denver
3     Kate  25.0          Rome
4      Bob  23.2          None
5     Jeff  25.0  Harrisonburg
6     Jack  23.2          None

3. To replace strings with a missing value

In [5]:
# To get the count of each value in a given column, use value_counts method with dropna=False as parameter so it count missing values as well
userDataFrame13 = pd.DataFrame({'name': ['Alice', 'Janvier', 'Naomie', 'Kate', 'Bob', 'Jeff', 'Jack'], 'age': [25, 30, 11, 25, None, 25, None], 'city': ['Rockville', 'Germantown', 'Denver', 'Rome', None, 'Harrisonburg', None]})
userDataFrame13['city'].value_counts(dropna=False)

None            2
Rockville       1
Germantown      1
Denver          1
Rome            1
Harrisonburg    1
Name: city, dtype: int64

In [ ]:
# To replace every missing value in a give column with a given string value, pass value='myvalue' as parameter to the fillna method on that column. Again the inplace=True just indicate that you want apply this change to the original dataframe
userDataFrame14 = pd.DataFrame({'name': ['Alice', 'Janvier', 'Naomie', 'Kate', 'Bob', 'Jeff', 'Jack'], 'age': [25, 30, 11, 25, None, 25, None], 'city': ['Rockville', 'Germantown', 'Denver', 'Rome', None, 'Harrisonburg', None]})
userDataFrame14['city'].fillna(value='Paris', inplace=True)
userDataFrame14